Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མ་བརྟེན་པར་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཡང་ཐོབ་པར་མི་ནུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: If it is not possible to attain the corresponding type of acceptance without relying on this way of the Dharma, what need to mention unsurpassable, completely perfect awakening?

source: ངའི་ཉན་ཐོས་གང་གཉི་གའི་ཆ་ལས་རྣམ་པར་གྲོལ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ།
en: My śrāvakas who are liberated from the two factors, who have meditative stability in the eight liberations, and who have attained correct discernment did so by following this way of the Dharma.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་དེ་དག་ཀྱང་ཆོས་ཀྱི་ཚུལ་འདི་ལ་བརྟེན་ནས་སོ། །འཇམ་དཔལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་ངན་དུ་བསམས་ཏེ་ངན་སོང་དུ་སྐྱེ་བ་ནི་སླའི་གཏམ་གཞན་རྣམས་ལ་དད་པར་བྱས་ཏེ་མཐོ་རིས་སུ་སྐྱེ་བ་ནི་དེ་ལྟ་མ་ཡིན་ནོ། །
en: “Mañjuśrī, it would not be better to have faith in another system and be born in the higher realms than to hear about this way of the Dharma, think negatively about it, and then be born in the lower realms.

source: འཇམ་དཔལ་གང་ཚུལ་འདི་ཐོས་ནས་སེམས་ཅན་དམྱལ་བར་སྐྱེས་པ་དེ་དག་ནི་རབ་ཏུ་མྱུར་བ་དེ་རྣམ་པར་ཐར་བར་འགྱུར་ཏེ།
en: Because, Mañjuśrī, those who are born in the hell realms after hearing about this way of the Dharma will very quickly be freed from them.

source: མཐོ་རིས་སུ་སྐྱེས་པ་དེ་དག་ནི་དེ་ལྟ་མ་ཡིན་ནོ། །
en: That is not the case for those who are born in the higher realms.

source: འཇམ་དཔལ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔས་ཚུལ་འདི་ཐོས་པར་འགྱུར་ཏེ།
en: “Mañjuśrī, bodhisattvas will hear about this way if they meet four criteria.

source: དེས་སྔོན་ཡང་ཚུལ་འདི་ཐོས་པར་གྱུར་ལ། ཐོས་ནས་ཀྱང་རྗེས་སུ་ཡི་རང་བ་དང་། དགེ་བའི་རྩ་བ་ཆེན་པོས་བརྟེན་པར་འགྱུར་བ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པར་འགྱུར་བ་དང་། ཐོས་པ་དང་ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བ་སྟེ།
en: They have heard it in the past and rejoiced in it afterward, they attained stability through the great roots of virtue, they are guided by a spiritual friend, and they have perfect learning and discipline.

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་ཚུལ་འདི་ཐོས་པར་འགྱུར་རོ། །
en: Mañjuśrī, bodhisattvas who meet these four criteria will hear about this way.

source: འཇམ་དཔལ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཚུལ་འདི་ཐོས་པར་འགྱུར་ཏེ།
en: “Mañjuśrī, bodhisattvas will hear about this way if they meet another four criteria.

source: ཚུལ་འདི་ནི་ཡིད་ལ་བྱེད་པ་ལ་རབ་ཏུ་བརྩོན་པར་འགྱུར་བ་དང་། ལས་ཀྱིས་འཇིགས་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། སྨོན་ལམ་བཏབ་པར་འགྱུར་བ་དང་། རང་བཞིན་གྱིས་དྲང་ཞིང་མཉེན་ལ་འགྲོགས་ན་བདེ་བར་འགྱུར་བ་སྟེ།
en: They energetically orient their minds to this way, are fearful of karma, make aspirations, and are naturally sincere, gentle, and easy to get along with.

source: འཇམ་དཔལ་ཆོས་བཞི་དང་ལྡན་ན་ཚུལ་འདི་ཐོས་ནས་སྤོང་བར་མི་འགྱུར་ཏེ།
en: “Mañjuśrī, bodhisattvas will not abandon this way upon hearing about it if they meet four criteria.

source: བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་པ་ཡིན། བཟོད་པ་ཐོབ་པ་ཡིན། ལྟ་བ་ཡང་དག་པར་ཞུགས་པ་ཡིན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཡིན་ཏེ།
en: They make aspirations to awaken, have attained acceptance, maintain a correct view, and are irreversibly on their way to unsurpassable, completely perfect awakening.

source: ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན། ཚུལ་འདི་ཐོས་ནས་སྤོང་བར་མི་འགྱུར་རོ། །
en: If they possess these four criteria, they will not abandon this way upon hearing about it.

source: འཇམ་དཔལ་ཆོས་བཞི་དང་ལྡན་ན་ཚུལ་འདི་ཐོས་ནས་དད་པར་འགྱུར་ཏེ།
en: “Mañjuśrī, bodhisattvas will develop trust upon hearing about this way if they meet four criteria.

source: ཐོས་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན། ཤེས་རབ་ཕུན་སུམ་ཚོགས་པ་ཡིན། སྟོང་པ་ཉིད་ཀྱི་བསམ་གཏན་པ་ཡིན།
en: They have perfect learning, have perfect insight, have meditative stability in emptiness, and have attained the power of dhāraṇī.

source: གཟུངས་ཐོབ་པ་ཡིན་ཏེ། ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་ཚུལ་འདི་ཐོས་ནས་དད་པར་འགྱུར་རོ། །
en: If they possess these four criteria, they will develop trust upon hearing about this way.

source: ཆོས་བཞི་དང་ལྡན་ན་ཚུལ་འདི་ཐོས་ནས་རབ་ཏུ་རྟོགས་པར་འགྱུར་ཏེ།
en: “Bodhisattvas will gain realization upon hearing about this way if they meet four criteria.

source: བསོད་ནམས་ཀྱི་ཚོགས་བསགས་པ་ཡིན། ཐོས་པའི་ཚོགས་བསགས་པ་ཡིན། ཡེ་ཤེས་ཀྱི་ཚོགས་བསགས་པ་ཡིན།
en: They have gathered the requisite of merit, they have gathered the requisite of learning, they have gathered the requisite of wisdom, and their minds have become pliable through the dhyānas.

source: བསམ་གཏན་རྣམས་ཀྱིས་སེམས་ལས་སུ་རུང་བ་ཡིན་ཏེ། ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་ཚུལ་འདི་ཐོས་ནས་རབ་ཏུ་རྟོགས་པར་འགྱུར་རོ། །
en: If they possess these four criteria, they will gain realization upon hearing about this way.

source: ཆོས་བཞི་དང་ལྡན་ན་ཚུལ་འདི་ཐོས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཐོབ་སྟེ།
en: “Bodhisattvas will receive the prophecy of their unsurpassable, completely perfect awakening of this way upon hearing about this way if they meet four criteria.

source: བཞི་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: What are the four?

source: གཟུགས་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་གཟུགས་སུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་དང་། ཚུལ་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཚུལ་དུ་ཐོས་པ་དང་། འདོད་པ་ཐམས་ཅད་དང་བྲལ་ཏེ་ཆད་ན་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་འདོད་པར་འགྱུར་བ་ཡང་མེད་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་ལས་ཀྱང་རྣམ་པར་མི་ལྡོག་པ་སྟེ།
en: They correctly see that all forms are forms of the Buddha; they hear about all ways as the way of the Buddha; they are free of wishes, even to the point of not wishing to awaken to buddhahood; and they do not turn away from great compassion.

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་ཏོ། །
en: Mañjuśrī, bodhisattvas who meet these four criteria are prophesied to reach unsurpassable, completely perfect awakening.

source: འཇམ་དཔལ་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ཚུལ་འདི་རྒྱུན་མི་འཆད་པར་མཉན་པར་བྱའོ། །
en: “Mañjuśrī, bodhisattvas should therefore constantly listen to this way.

source: མྱུར་དུ་ངེས་པར་འབྱུང་བར་འདོད་པས་ཀྱང་ཚུལ་འདི་མཉན་པར་བྱའོ། །
en: Those who wish to quickly escape should listen to this way.

source: ལུང་བསྟན་པའི་ས་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔས་ཀྱང་ཚུལ་འདི་མཉན་པར་བྱའོ། །
en: Bodhisattvas who wish for the status of being prophesied should listen to this way.

source: ལས་ཀྱི་སྒྲིབ་པ་བྱང་བར་འདོད་པ་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པ་དང་། ཤེས་བྱའི་སྒྲིབ་པ་དང་། འགྲོ་བའི་སྒྲིབ་པ་བྱང་བར་འདོད་པས་ཀྱང་ཚུལ་འདི་མཉན་པར་བྱའོ། །
en: Those who wish to purify the obscurations of karma, the obscurations of the afflictive emotions, the cognitive obscurations, and impediments to progress should listen to this way.

source: དེ་བཞིན་གཤེགས་པ་ལ་བླ་ན་མེད་པའི་མཆོད་པ་བྱེད་པར་འདོད་པས་ཀྱང་ཚུལ་འདི་མཉན་པར་བྱའོ། །
en: Those who wish to make an unsurpassable offering to the Thus-Gone One should listen to this way.

source: དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་འདོད་པས་ཀྱང་ཚུལ་འདི་ཉིད་མཉན་པར་བྱའོ། །
en: Those who wish to uphold the sublime Dharma should listen to this way.

source: འཇམ་དཔལ་གང་ཆོས་ཀྱི་ཚུལ་འདི་ཐོས་ནས་འཇུག་པ་དང་། མི་སྤོང་བ་དང་། མི་སྨོད་པར་འགྱུར་བའི་སེམས་ཅན་དེ་དག་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་བྱའོ། །
en: Mañjuśrī, I will prophesy the unsurpassable, completely perfect awakening of those beings who hear this way and adopt it, do not abandon it, and do not disparage it.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩོམ་པ་མེད་ཀྱིས་དེའི་ཚེ་མུ་ཏིག་གི་དོ་ཤལ་བརྒྱ་སྟོང་རི་བ་མགུལ་ནས་བཀྲོལ་ཏེ།
en: At that moment the bodhisattva great being Nirārambha unfastened a pearl necklace worth a hundred thousand and cast it toward the Blessed One.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་གཏོར་ནས་ཚིག་འདི་སྐད་དུ་བཅོམ་ལྡན་འདས་སྦྱིན་པའི་ཆོས་འདིས་སེམས་ཅན་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཅི་འདྲ་བ་དེ་འདྲ་བར་གྱུར་ཅིག་ཅེས་སྨྲས་སོ། །
en: He then said, “Blessed One, through the Dharma of giving, may all beings become exactly like the thus-gone, blessed, completely perfect Buddha.”

source: དེ་ནས་མུ་ཏིག་གི་དོ་ཤལ་དེ་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་གི་དྲང་ཐད་ན་ཁང་པ་བརྩེགས་པ་རྣམ་པར་བཀྲ་བ། གྲུ་བཞི་ལྷ་མ་པ། ལྷ་དང་མིས་ལྟ་བར་བྱེད་པ།
en: The pearl necklace then became a mansion directly above the Blessed One’s head that was visible to both gods and humans.

source: ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་རྣམས་ཀྱིས་སྔོན་མ་མཐོང་མ་ཐོས་པ་འདུག་པར་གྱུར་ཏེ།
en: It was a beautifully decorated square palace that had not been previously seen or heard about by the great śrāvakas, bodhisattvas, Indra, Brahmā, or the world guardians.

source: དེ་བཅོམ་ལྡན་འདས་གཤེགས་པའི་རྗེས་སུ་འགྲོ་ཞིང་བཞུགས་པའི་རྗེས་སུ་གནས་སོ། །
en: It followed the Blessed One as he moved and remained in place when he sat.

source: དེའི་ཚེ་ལྷ་དང་མི་ཕལ་ཆེར་ངོ་མཚར་དུ་གྱུར་རྨད་དུ་བྱུང་བར་གྱུར་ཏེ། ཡ་མཚན་དུ་བྱ་བ་སྐྱེས་ནས་སྤྱི་བོར་ཐལ་མོ་སྦྱར་ཏེ།
en: The great crowd of gods and humans were astounded and amazed; filled with wonder, they joined their palms above their heads.

source: བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས་མིག་མི་འཛུམས་པར་གནས་པར་གྱུར་ཏོ། །
en: They then bowed toward the Blessed One and remained there, wide-eyed.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩོམ་པ་མེད་ངོ་མཚར་དུ་གྱུར་ནས་དགའ་བ་སྐྱེས་ཏེ།
en: The bodhisattva great being Nirārambha felt amazed and delighted.

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་གཏུགས་ནས་ཕྱག་འཚལ་ཏེ།
en: He adjusted his upper robe on one shoulder, knelt down on his right knee, touched the Blessed One’s feet, and bowed.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་མངོན་སུམ་དུ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །ཡོན་ཏན་མང་པོ་ཀུན་གྱི་སྣོད་གྱུར་པ། །ས་དང་ལྷ་ཡུལ་འགྲོ་བའི་མགོན་གཅིག་པུ། །
en: He then faced the Blessed One, joined his palms, bowed slightly, and praised him directly with these verses: “You are a repository of all the various qualities, The sole protector of beings on earth and in the heavens.

source: བདེ་གཤེགས་ཞི་ཞིང་རབ་ཏུ་ཞི་ལ་དགྱེས། །
en: Well-Gone One, you delight in peace and tranquility.

source: ཁྱོད་མཚུངས་འཇིག་རྟེན་མ་མཆིས་ག་ལ་ལྷག །
en: You have no equal in the world—how could you be surpassed?

source: བློ་གྲོས་མཉམ་ཞིང་གཡོ་མེད་མཚུངས་པར་སྦྱོར། །
en: “Your intellect is even, unwavering, and harmonizing.

source: བདག་པོ་ཐུགས་རྗེས་རབ་ཏུ་ཟིན་པའི་ཐུགས། །
en: Lord, your mind bears great compassion.

source: ནམ་མཁའི་དཀྱིལ་ལྟར་ཐུགས་ནི་མ་གོས་ཏེ། །ཕན་རན་ཡང་དག་བཀའ་མཆིད་གསུང་ཞིང་སྤྱོད། །
en: Like the sky, your mind remains unsullied, Equally beneficent; your words and deeds are true.

source: ཁྱོད་ལ་དགྲ་དང་ཟིན་ནི་མི་མངའ་སྟེ། །བདག་པོ་དགྱེས་དང་མི་དགྱེས་ཡོང་མི་མངའ། །
en: “You have no enemies or friends, Nor, Lord, do you feel joy or despair.

source: སྨན་པ་བཞིན་དུ་འགྲོ་བ་གསོ་མཛད་ཅིང་། །ཐུགས་རྗེ་བསྐྱེད་ནས་རྣམ་པར་མི་རྟོག་སྤྱོད། །
en: Like a doctor you tend to the care of beings, Acting without concept while arousing compassion.

source: ལྷ་མིན་ལྷ་དང་ཀླུ་དང་ནམ་མཁའ་ལྡིང་། །གནོད་སྦྱིན་ཁྱོད་ལ་སྐྱབས་མཆིས་ཞི་བ་ཐོབ། །
en: “Asuras, gods, nāgas, garuḍas, and yakṣas Take refuge in you and find peace.

source: མགོན་པོ་སྲིད་པ་གསུམ་ན་ཕན་མཛད་པ། །
en: Protector, you are beneficent in the three existences.

source: ཐུབ་པ་ཁྱོད་ལ་བདག་ནི་སྐྱབས་སུ་མཆི། །
en: I seek refuge in you, Sage.

source: བདེ་གཤེགས་ཁྱོད་ནི་འདུས་མ་བགྱིས་མི་གཟིགས། །
en: “Well-Gone One, you do not see the uncompounded.

source: ཞི་ཐུགས་ཞི་ལའང་ཡོན་ཏན་མི་གཟིགས་ཏེ། །
en: Of peaceful mind, you still see no qualities in peace.

source: གཉི་གའི་ཚུལ་སྤངས་རྣམ་རྟོག་མི་མངའ་བར། །བདག་པོ་མྱ་ངན་འདས་ནས་འཇིག་རྟེན་སྤྱོད། །
en: Rejecting the ways of both, you hold no concepts— Lord, you pass into nirvāṇa and then act in the world.

source: རབ་ཞིའི་ཡོན་ཏན་རྒྱ་མཚོ་གཏིང་ཚོད་ཡས། །སྟོབས་བཅུ་ཉིད་དུ་ཡོན་ཏན་མཁྱེན་པར་གྱུར། །ས་དང་ནམ་མཁའ་ལྟ་བུར་ཚད་མེད་ཆོས། །
en: “Your tranquility is unfathomable like the ocean, You know the qualities of the ten strengths, And your qualities are boundless as the earth and sky.

source: མགོན་ལ་ཐལ་མོ་སྦྱར་ཏེ་མགོས་ཕྱག་འཚལ། །
en: I join my hands and bow my head to you, protector.

source: སྲིད་པའི་ཆུ་བོར་མི་རྐྱལ་མི་ནུབ་ཅིང་། །
en: “You neither swim nor sink in the river of existence.

source: སེམས་ཅན་མཆོག་ནི་མེ་ཁྱེར་མི་བཞུགས་སོ། །
en: Best of beings, you are not carried away nor stay in place.

source: ཁྱོད་མི་གཅིག་པུ་སྲིད་མཚོའི་ཕ་རོལ་གཤེགས། །དཔེ་མེད་རྒྱ་མཚོའི་བློ་ལ་ཕྱག་འཚལ་ལོ། །
en: You alone crossed over the ocean of existence; I bow before you of incomparable oceanic mind.

source: པད་མ་བཞིན་དུ་ཆུ་ཡིས་མི་གོས་པ། །ས་ལ་འཇིག་རྟེན་ཆོས་གྲོལ་རབ་ཏུ་གསུང་། །
en: “Like a lotus you are not sullied by water; On earth, you teach liberation from worldly ways.

source: ཁྱོད་ཀྱི་མཁྱེན་པ་སུ་དང་མི་མཚུངས་ཏེ། །མཚུངས་མེད་བློ་གྲོས་ཁྱོད་ལ་བདག་སྐྱབས་མཆི། །
en: Your knowledge is unequaled by anyone— I take refuge in you of unmatched intellect.

source: ཁྱོད་ནི་མི་མཁྱེན་ཅུང་ཟད་འདིར་མི་མངའ། །
en: “There is not the slightest thing here you do not know.

source: སྟོབས་བཅུ་ལྡན་པས་ཀུན་དུ་ཡོང་མི་བསྙེངས། །འཁོར་ལ་ང་འདྲ་སུ་ཡང་མེད་ཅེས་གསུང་། །
en: Utterly fearless with your ten strengths, You announce, ‘There is no one like me in saṃsāra.’

source: དེ་སླད་ཁྱོད་ནི་དཔའ་བོ་གཅིག་པུ་རྒྱུ། །
en: Thus are you uniquely heroic.

source: མི་གང་ཁྱོད་བཀའ་བདུད་རྩི་སྣོད་གྱུར་པ། །དེ་དག་མདོར་ན་སྲིད་པའི་འཇིགས་དང་བྲལ། །
en: “Those who are vessels for your nectar-like words Are, simply put, fearless about existence.

source: སྨན་པ་དམ་པ་མཆོད་འོས་འཇིག་རྟེན་མགོན། །ཐུགས་རྗེ་ལྡན་པ་ཁྱོད་ལ་བདག་སྐྱབས་མཆི། །
en: Sublime doctor, world protector worthy of worship, I take refuge in you, compassionate one.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བདག་གི་བསམ་པ་མཁྱེན་ཏེ།
en: The bodhisattva Nirārambha then addressed the Blessed One: “The Blessed One knows my intent.

source: བཅོམ་ལྡན་འདས་བདག་ནི་བདག་གི་སླད་དུ་མཆོད་པ་མི་བགྱིད་ཀྱི།
en: Blessed One, I do not make this offering for my own sake.

source: གང་བདག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་མུ་ཏིག་གི་དོ་ཤལ་ཕུལ་ཞིང་བསྟོད་པ་དང་། མཆོད་པའི་དགེ་བའི་རྩ་བ་འདིས་བཅོམ་ལྡན་འདས་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཉིད་ཐོབ་པར་གྱུར་ཅིག །
en: Rather, through the roots of virtue from this offering of a pearl necklace and praise to the thus-gone, blessed, completely perfect Buddha, may all beings attain buddhahood, Blessed One.

source: བཅོམ་ལྡན་འདས་འདི་ནི་བདག་གི་བསམ་པ་ལགས་སོ། །
en: This is my intention, Blessed One.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་འཛུམ་པ་མཛད་དོ། །
en: At that, the Blessed One smiled.

source: འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ་གང་གི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པ་དེ་ནི། བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་ཐ་དད་པ་ཁ་དོག་དུ་མ་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཁ་དང་།
en: As is a basic truth of the blessed buddhas, when the blessed Buddha smiled, light rays of various colors and hues—blue, yellow, red, white, crimson, and crystal-clear—emerged from the Blessed One’s mouth, illuminated the boundless expanse of world systems, and brought peace to beings tormented in the lower realms.

source: ཤེལ་གྱི་ཁ་དོག་ལྟ་བུ་བྱུང་སྟེ། དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་འོད་ཀྱིས་སྣང་བར་བྱས་ནས་ངན་སོང་དུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་གདུང་བ་ཡང་རབ་ཏུ་ཞི་བར་བྱས། ལྷ་དང་མི་རྣམས་ཀྱང་སིམ་པར་བྱས་ནས་སླར་ལོག་སྟེ། བཅོམ་ལྡན་འདས་ལ་ལན་དུ་མར་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་ནུབ་པར་གྱུར་ཏོ། །
en: After gratifying gods and humans, the light rays returned, circled the Blessed One many times, and descended into the crown of his head.

source: འོད་ཟེར་དེ་དག་མཐོང་བའི་འཁོར་དེ་ཐམས་ཅད་ཀྱང་ཡིད་འདུན་ཅིང་རབ་ཏུ་དགའ་བ་དང་། བདེ་བ་དང་།
en: The entire assembly also saw the light rays and experienced awe, delight, happiness, and bliss.

source: ཡིད་བདེ་བ་སྐྱེས་ནས་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ལུས་བཏུད་ནས་འདུག་སྟེ། །
en: They joined their palms, bowed while facing the Blessed One, and sat down.

source: བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པའི་རྒྱུ་ཅི་ཡིན་སྙམ་མོ། །
en: They wondered, “What prompted the Blessed One’s smile?”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: The venerable Ānanda then rose from his seat, adjusted his upper robe on one shoulder, and knelt down on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བཅོམ་ལྡན་འདས་ལ་འཛུམ་པ་མཛད་པའི་དོན་ཞུས་པ། དཔའ་ཆེན་ཁྱོད་ཀྱིས་འཛུམ་མཛད་པས། །ལྷ་དང་མིར་བཅས་འཇིག་རྟེན་འདི། །ཁྱོད་ཀྱིས་འཛུམ་པ་མཛད་པ་ལ། །ཐེ་ཚོམ་འཚལ་ནས་ལྟ་ཞིང་མཆིས། །
en: Facing the Blessed One, he joined his palms, bowed, and asked the Blessed One in verse about the meaning of his smile: “When you smiled, Great Hero, The gods and humans of this world, Perplexed by your smile, Stopped and stared.

source: འདོད་ཆགས་བྲལ་བ་དཔའ་བོ་ཁྱོད། །ཐམས་ཅད་མཁྱེན་པ་རྣམ་པར་འདྲེན། །རྒྱུ་མ་མཆིས་པར་འཛུམ་མི་མཛད། །
en: “Hero free of desire, Omniscient Guide, You do not smile without reason.

source: སྐྱོན་མི་མངའ་བ་འཛུམ་དོན་གསུངས། །
en: Faultless One, tell us the meaning of your smile.

source: ཐུབ་པའི་ཞལ་ནས་འོད་བཏང་བ། །གསལ་ཞིང་དག་ལ་ཡིད་དུ་མཆི། །
en: “Light shines from the mouth of the Sage, Clear, pure, and astonishing.

source: ལྷ་མི་ངན་སོང་མཆིས་པ་རྣམས། །དེ་ཡིས་རེག་པས་བདེ་བར་གྱུར། །
en: Gods, humans, and denizens of the lower realms Are gladdened by its touch.

source: སེམས་ཅན་ཆེན་པོ་ཁྱོད་ཞལ་ནས། །འོད་ཟེར་དག་ནི་རབ། །བཏང་བ། །
en: “Great Being, from your mouth Shine forth rays of light.

source: དེ་ནི་ཅི་ཞིག་དོན་དུ་བསྟན། །
en: Tell us about their meaning.

source: ཐུགས་རྗེ་ཅན་གྱིས་ལུང་བསྟན་གསོལ། །
en: Compassionate One, please explain.

source: འོད་ཟེར་ཁ་དོག་དཀར་པོ་དག །ཚེམས་ཀྱི་ཕྲག་ནས་མཛེས་བྱུང་བ། །
en: “Rays of light, white in color, Shine elegantly from between your teeth.

source: དེ་དག་གིས་ནི་ཉི་མའི་ཟེར། །ཤིན་ཏུ་མཛེས་པར་ཤར་བ་དག །གང་སླད་འཇིག་རྟེན་དགར་འགྱུར་བར། །དེང་དུ་སྣག་ཚའི་མདོག་བཞིན་བགྱིས། །
en: How do these solar rays, Dawning with exceptional beauty, Delight the world, Which until then had been dark as soot?

source: མགོན་ཁྱོད་གང་ལ་ཐུགས་རྗེ་ཞིང་། །སུ་ཡི་བསྐལ་པ་ཉེ་བར་གནས། །རྒྱུ་དང་དོན་ནི་མ་མཆིས་པར། །འདོད་ཆགས་བྲལ་བ་འཛུམ་མི་མཛད། །
en: “Compassionate Protector Whose eon is at hand, Free from desire, you do not smile Without reason or purpose.

source: ཐུགས་རྗེ་ཐུགས་ཀྱིས་ལུང་སྟོན་ཏེ། །ཐེ་ཚོམ་རྣམ་པར་བསལ་བར་མཛོད། །ཇི་ལྟར་ཁྱོད་ཀྱི་ཞལ་ནས་སུ། །
en: “Give us the prophecy out of compassion, Please dispel our doubts.

source: འོད་ཟེར་བྱུང་ནས་སླར་ལོག་སྟེ། །འོད་ནི་འཇིག་རྟེན་མགོན་པོ་ཡི། །དབུ་ཡི་གཙུག་ཏུ་ནུབ་གྱུར་པ། །གློག་རིས་བཞིན་དུ་ནམ་མཁའ་ལ། །དགེ་བ་དཔག་མེད་བཀྲ་བགྱིད་པ། །
en: “The light that left your mouth, Once again returned, And then descended into The World Protector’s crown “Has, like lightning, Painted boundless virtue in the sky.

source: རྣམ་པར་འདྲེན་པ་དེ་དག་གིས། །ཐམས་ཅད་མཁྱེན་པའི་སྤྱོད་པ་སྟོན། །
en: Guide, all of this reveals The conduct of an omniscient one.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩོམ་པ་མེད་པ་འདི་བསྐལ་པ་བཅུ་གཉིས་ན།
en: The Blessed One then addressed the venerable Ānanda: “Ānanda, the bodhisattva great being Nirārambha will reach buddhahood in twelve eons.

source: ལྷས་མངོན་པར་བསྟོད་པའི་བསྐལ་པ་ལ་དགའ་བ་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འོད་ཆེན་པོ་ཞེས་བྱ་བའི་སངས་རྒྱས་སུ་འགྱུར་ཏེ།
en: During the eon Praised by the Gods he will become the buddha named Great Light in the world Great Joy.

source: རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ་སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ།
en: He will be perfect in knowledge and conduct, a well-gone one, a world-knower, and a charioteer for people to be tamed.

source: བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་འགྱུར་རོ། །
en: He will be unsurpassed, a teacher of gods and humans, a blessed buddha.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་འོད་ཆེན་པོའི་ཚེའི་ཚད་ནི་བསྐལ་པ་གཅིག་ཐུབ་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་ཚེའི་ཚད་ནི་བར་གྱི་བསྐལ་པ་བཅུ་གཉིས་ཐུབ་པར་འགྱུར་རོ། །
en: Ānanda, the Thus-Gone One Great Light will have a lifespan that lasts one eon, while the lifespan of those bodhisattvas will last twelve intermediate eons.

source: ཀུན་དགའ་བོ་འདི་ལྟ་སྟེ། དཔེར་ན་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་ཀུན་སྤྱོད་པ་ལྟར། སངས་རྒྱས་ཀྱི་ཞིང་དེའི་སེམས་ཅན་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་ཀུན་སྤྱོད་པ་ཡང་དེ་འདྲ་བར་འགྱུར་རོ། །
en: Ānanda, as a comparison, the enjoyments and activities of beings in that buddhafield will be just like those of the gods in the Heaven of Controlling Others’ Emanations.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩོམ་པ་མེད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་སུ་འགྱུར་རོ་ཞེས་ལུང་བསྟན་པ་ནི་ཁྱོད་ཀྱིས་རྙེད་པ་ལེགས་པར་རྙེད་དོ། །
en: The venerable Subhūti then addressed the bodhisattva great being Nirārambha: “Child of good family, the Blessed One prophesied that you will become a buddha and easily achieve success.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་འདི་ལ་སུ་ཞིག་སངས་རྒྱས་སུ་འགྱུར་ཤེས་སམ།
en: The bodhisattva Nirārambha asked, “Honorable Subhūti, do you know who here will become a buddha?”

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་གང་སངས་རྒྱས་སུ་འགྱུར་བའི་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: “Child of good family,” replied Subhūti, “I do not clearly see the qualities of those who will become buddhas.”

source: སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་གལ་ཏེ་གང་སངས་རྒྱས་སུ་འགྱུར་བའི་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ན་ཁྱོད་སངས་རྒྱས་སུ་འགྱུར་བར་ལུང་བསྟན་ཏོ་ཞེས་བྱ་བར་དེ་མི་བསྟིང་ངམ།
en: “Honorable Subhūti, if you do not clearly see the qualities of those who will become buddhas, are you not undermining your statement, ‘You have been prophesied to become a buddha’?”

source: རབ་འབྱོར་གྱིས་སྨྲས་པ།
en: asked Nirārambha.

source: རིགས་ཀྱི་བུ་ཁྱོད་བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་སུ་འགྱུར་རོ་ཞེས་ལུང་མ་བསྟན་ཏམ། སྨྲས་པ།
en: “Child of good family,” replied Subhūti, “the Blessed One prophesied that you would become a buddha, did he not?”

source: བཙུན་པ་རབ་འབྱོར་དོན་ཡོངས་སུ་མཁྱེན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་དུ་སངས་རྒྱས་སུ་འགྱུར་རོ་ཞེས་གསུངས་སོ། །
en: Nirārambha said, “Honorable Subhūti, the Blessed One said the words ‘become a buddha’ fully knowing what was meant.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་དོན་ཡོངས་སུ་མཁྱེན་པ་གང་ཞེ་ན།
en: What meaning is it that is fully known to a thus-gone one?

source: བྱང་ཆུབ་སེམས་དཔའ་གང་བྱང་ཆུབ་ཏུ་སྨོན་པ་དེ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ལུང་མི་སྟོན་ཏོ། །
en: The thus-gone ones do not prophesy about bodhisattvas who aspire to awaken.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་བྱང་ཆུབ་ཏུ་མི་སྨོན་པ་དེ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ལུང་སྟོན་ཏོ། །
en: The thus-gone ones prophesy about bodhisattvas who do not aspire to awaken.

source: དེ་བས་ན་དོན་ཡོངས་སུ་མཁྱེན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ནི་སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་ཕྱིར་འདི་སྐད་དུ་སངས་རྒྱས་སུ་འགྱུར་རོ་ཞེས་གསུངས་ན།
en: Therefore, the Blessed One, fully knowing what was meant, said ‘become a buddha’ in order to develop the roots of virtue of beings.

source: ཁྱོད་ཅི་ཞིག་ལ་ལྟོས་བསམས་ནས་འདི་སྐད་དུ་སངས་རྒྱས་སུ་འགྱུར་རོ་ཞེས་སྨྲ།
en: What were you thinking of when you said ‘become a buddha’?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ཀྱི་ཐ་སྙད་འདི་ནི་འཇིག་རྟེན་གྱི་ཐ་སྙད་དོ། །
en: “Child of good family,” replied Subhūti, “the conventions used by the Blessed One’s śrāvakas are the same conventions used in the world.”

source: སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་འཕགས་པ་རྣམས་ལ་འཇིག་རྟེན་གྱི་ཐ་སྙད་ཀྱིས་གདགས་སུ་མེད་དོ། །
en: “Honorable Subhūti, noble ones do not use worldly conventions,” countered Nirārambha.

source: འཕགས་པ་ཐ་སྙད་འདོགས་པ་ནི་བདེན་པའོ། །འཇིག་རྟེན་ཐ་སྙད་འདོགས་པ་ནི་ལོག་པའོ། །
en: The conventions of the noble ones are true, while worldly conventions are false.

source: བཙུན་པ་རབ་འབྱོར་དེ་བས་ན་འཇིག་རྟེན་གྱི་ཐ་སྙད་ལོག་པ་འཕགས་པ་རྣམས་ལ་རྗོད་པར་མི་འོས་སོ། །
en: Therefore, honorable Subhūti, it is not appropriate to speak to noble ones using false worldly conventions.

source: བཙུན་པ་རབ་འབྱོར་འཇིག་རྟེན་ནི་བསྲུང་བར་བྱ་བ་ཡིན་ཏེ།
en: Honorable Subhūti, worldly beings should be protected, but they are scared of the ultimate.

source: དོན་དམ་པས་དངངས་སུ་འོང་ཞེས་དེ་ལ་འཕགས་པ་རྣམས་སྙིང་རྗེ་ཆེན་པོས་བདེན་པ་ཡང་དག་པ་བཏང་ནས་བྱིས་པ་རྣམས་ལ་ལོག་པར་ཐ་སྙད་འདོགས་ཀྱི།
en: Noble ones therefore compassionately set aside the authentic truth and use false conventions with foolish beings.
